In [2]:
import pandas as pd
data = {'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, 35]}
df = pd.DataFrame(data) #crester dataframe

In [3]:
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [7]:
df["salary"]=[20000,40000,60000] #write data
df

      Name  Age  salary
0    Alice   25   20000
1      Bob   30   40000
2  Charlie   35   60000

In [8]:
data=pd.read_csv("C:/topical_chat.csv") #read data 
data

,conversation_id,message,sentiment
0,1,Are you a fan of Google or Microsoft?,Curious to dive deeper
1,1,Both are excellent technology they are helpfu...,Curious to dive deeper
2,1,"I'm not a huge fan of Google, but I use it a...",Curious to dive deeper
3,1,Google provides online related services and p...,Curious to dive deeper
4,1,"Yeah, their services are good. I'm just not a...",Curious to dive deeper
...,...,...,...
188373,8628,"Wow, it does not seem like that long. Since I...",Surprised
188374,8628,"I havent seen that episode, I might google it...",Curious to dive deeper
188375,8628,I don't think I have either. That's an insane...,Curious to dive deeper
188376,8628,"I did, my little brother used to love Thomas ...",Happy
188377,8628,"It did. Ringo Starr, George Carlin, and Alec ...",Neutral

In [12]:
import pandas as pd

# Create a DataFrame with missing values
data = {'A': [1, 2, None, 4], 'B': [None, 2, 3, 4]}
df = pd.DataFrame(data)
df

     A    B
0  1.0  NaN
1  2.0  2.0
2  NaN  3.0
3  4.0  4.0

In [13]:
# Check for missing values
print(df.isnull())

       A      B
0  False   True
1  False  False
2   True  False
3  False  False

In [15]:
# Fill missing values with a specific value (e.g., 0)
df_filled = df.fillna(0)
df_filled

     A    B
0  1.0  0.0
1  2.0  2.0
2  0.0  3.0
3  4.0  4.0

In [16]:
# Drop rows with missing values
df_cleaned = df.dropna()
df_cleaned

     A    B
1  2.0  2.0
3  4.0  4.0

In [17]:
#DataFiltering
# Filter rows where column A is greater than 2
filtered_df = df[df['A'] > 2]

# Filter rows using multiple conditions (AND)
filtered_df = df[(df['A'] > 2) & (df['B'] < 6)]

In [18]:
filtered_df

     A    B
3  4.0  4.0